mtosi1.1-TestSuite/TestsDefinitions/AlarmRetrieval/examples/AlarmRetrieval_getActiveAlarms3.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="tmf854.v1 ..\..\..\..\xsd\common\Header.xsd tmf854.v1 ..\..\..\..\xsd\interfaces\AlarmRetrieval.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<header tmf854Version="1.1">
			<activityName>getActiveAlarms</activityName>
			<msgName>getActiveAlarms</msgName>
			<msgType>REQUEST</msgType>
			<correlationId>0001</correlationId>
			<senderURI>/MTOSI/AlarmOS</senderURI>
			<destinationURI>/MTOSI/EMS01</destinationURI>
			<communicationPattern>SimpleResponse</communicationPattern>
			<communicationStyle>MSG</communicationStyle>
			<timestamp>20051004140305</timestamp>
		</header>
	</soap:Header>
	<soap:Body>
		<getActiveAlarms tmf854Version="1.1">
			<filter>
				<scope>
					<name>
						<mdNm>Networks/XdrEMS/Server1 </mdNm>
						<meNm>20005</meNm>
					</name>
					<name>
						<mdNm>Networks/XdrEMS/Server1 </mdNm>
						<meNm>19204</meNm>
					</name>
				</scope>
				<perceivedSeverityList>
					<perceivedSeverity>PS_MAJOR</perceivedSeverity>
					<perceivedSeverity>PS_MINOR</perceivedSeverity>
					<perceivedSeverity>PS_CLEARED</perceivedSeverity>
				</perceivedSeverityList>
				<probableCauseList>
					<probableCause>
						<type>BER_SD</type>
					</probableCause>
					<probableCause>
						<type>EQPT</type>
					</probableCause>
				</probableCauseList>
				<acknowledgeIndication>AI_EVENT_UNACKNOWLEDGED</acknowledgeIndication>
			</filter>
		</getActiveAlarms>
	</soap:Body>
</soap:Envelope>
